LHYWilliam/STM32F407VET6/System/sys.h
#ifndef _SYS_H
#define _SYS_H

#include "stm32f4xx_hal.h"

//////////////////////////////////////////////////////////////////////////////////
// 系统时钟初始化
// 包括时钟设置/中断管理/GPIO设置等
//////////////////////////////////////////////////////////////////////////////////

// 0,不支持os
// 1,支持os
#define SYSTEM_SUPPORT_OS 1 // 定义系统文件夹是否支持OS
///////////////////////////////////////////////////////////////////////////////////
// 定义一些常用的数据类型短关键字
typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32;
typedef const int16_t sc16;
typedef const int8_t sc8;

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32;
typedef __I int16_t vsc16;
typedef __I int8_t vsc8;

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

typedef const uint32_t uc32;
typedef const uint16_t uc16;
typedef const uint8_t uc8;

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32;
typedef __I uint16_t vuc16;
typedef __I uint8_t vuc8;

// 位带操作,实现51类似的GPIO控制功能
// 具体实现思想,参考<<CM3权威指南>>第五章(87页~92页).M4同M3类似,只是寄存器地址变了.

// IO口操作宏定义
#define BITBAND(addr, bitnum)                                                  \
    ((addr & 0xF0000000) + 0x2000000 + ((addr & 0xFFFFF) << 5) + (bitnum << 2))
#define MEM_ADDR(addr)         *((volatile unsigned long *)(addr))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND(addr, bitnum))

// IO口地址映射
#define GPIOA_ODR_Addr         (GPIOA_BASE + 20) // 0x40020014
#define GPIOB_ODR_Addr         (GPIOB_BASE + 20) // 0x40020414
#define GPIOC_ODR_Addr         (GPIOC_BASE + 20) // 0x40020814
#define GPIOD_ODR_Addr         (GPIOD_BASE + 20) // 0x40020C14
#define GPIOE_ODR_Addr         (GPIOE_BASE + 20) // 0x40021014
#define GPIOF_ODR_Addr         (GPIOF_BASE + 20) // 0x40021414
#define GPIOG_ODR_Addr         (GPIOG_BASE + 20) // 0x40021814
#define GPIOH_ODR_Addr         (GPIOH_BASE + 20) // 0x40021C14
#define GPIOI_ODR_Addr         (GPIOI_BASE + 20) // 0x40022014
#define GPIOJ_ODR_ADDr         (GPIOJ_BASE + 20) // 0x40022414
#define GPIOK_ODR_ADDr         (GPIOK_BASE + 20) // 0x40022814

#define GPIOA_IDR_Addr         (GPIOA_BASE + 16) // 0x40020010
#define GPIOB_IDR_Addr         (GPIOB_BASE + 16) // 0x40020410
#define GPIOC_IDR_Addr         (GPIOC_BASE + 16) // 0x40020810
#define GPIOD_IDR_Addr         (GPIOD_BASE + 16) // 0x40020C10
#define GPIOE_IDR_Addr         (GPIOE_BASE + 16) // 0x40021010
#define GPIOF_IDR_Addr         (GPIOF_BASE + 16) // 0x40021410
#define GPIOG_IDR_Addr         (GPIOG_BASE + 16) // 0x40021810
#define GPIOH_IDR_Addr         (GPIOH_BASE + 16) // 0x40021C10
#define GPIOI_IDR_Addr         (GPIOI_BASE + 16) // 0x40022010
#define GPIOJ_IDR_Addr         (GPIOJ_BASE + 16) // 0x40022410
#define GPIOK_IDR_Addr         (GPIOK_BASE + 16) // 0x40022810

// IO口操作,只对单一的IO口!
// 确保n的值小于16!
#define PAout(n)               BIT_ADDR(GPIOA_ODR_Addr, n) // 输出
#define PAin(n)                BIT_ADDR(GPIOA_IDR_Addr, n) // 输入

#define PBout(n)               BIT_ADDR(GPIOB_ODR_Addr, n) // 输出
#define PBin(n)                BIT_ADDR(GPIOB_IDR_Addr, n) // 输入

#define PCout(n)               BIT_ADDR(GPIOC_ODR_Addr, n) // 输出
#define PCin(n)                BIT_ADDR(GPIOC_IDR_Addr, n) // 输入

#define PDout(n)               BIT_ADDR(GPIOD_ODR_Addr, n) // 输出
#define PDin(n)                BIT_ADDR(GPIOD_IDR_Addr, n) // 输入

#define PEout(n)               BIT_ADDR(GPIOE_ODR_Addr, n) // 输出
#define PEin(n)                BIT_ADDR(GPIOE_IDR_Addr, n) // 输入

#define PFout(n)               BIT_ADDR(GPIOF_ODR_Addr, n) // 输出
#define PFin(n)                BIT_ADDR(GPIOF_IDR_Addr, n) // 输入

#define PGout(n)               BIT_ADDR(GPIOG_ODR_Addr, n) // 输出
#define PGin(n)                BIT_ADDR(GPIOG_IDR_Addr, n) // 输入

#define PHout(n)               BIT_ADDR(GPIOH_ODR_Addr, n) // 输出
#define PHin(n)                BIT_ADDR(GPIOH_IDR_Addr, n) // 输入

#define PIout(n)               BIT_ADDR(GPIOI_ODR_Addr, n) // 输出
#define PIin(n)                BIT_ADDR(GPIOI_IDR_Addr, n) // 输入

#define PJout(n)               BIT_ADDR(GPIOJ_ODR_Addr, n) // 输出
#define PJin(n)                BIT_ADDR(GPIOJ_IDR_Addr, n) // 输入

#define PKout(n)               BIT_ADDR(GPIOK_ODR_Addr, n) // 输出
#define PKin(n)                BIT_ADDR(GPIOK_IDR_Addr, n) // 输入

#endif
